test/bench/evidence/20260714-1005-06dc4acd5/e_write_fsync16-linux-r2.log
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.hle [bit 4]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.rtm [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512f [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512dq [bit 17]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512cd [bit 28]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512bw [bit 30]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].EBX.avx512vl [bit 31]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi [bit 1]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vbmi2 [bit 6]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512vnni [bit 11]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512bitalg [bit 12]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.avx512-vpopcntdq [bit 14]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=07h,ecx=00h].ECX.la57 [bit 16]
qemu-system-x86_64: warning: host doesn't support requested feature: CPUID[eax=80000008h].EBX.wbnoinvd [bit 9]
cSeaBIOS (version rel-1.17.0-0-gb52ca86e094d-prebuilt.qemu.org)


iPXE (http://ipxe.org) 00:02.0 CA00 PCI2.10 PnP PMM+7EFD1900+7EF31900 CA00
                                                                               


Booting from ROM...
c[    0.339230] kvm_intel: VMX not supported by CPU 0
Running benchmark: fio/ext4_p9_param on linux
The VM is ready for the benchmark.
P9CFG mode=write rw=write bs=1M nj=1 fsync=16 size=1G
P9CASE write
p9write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=sync, iodepth=1
fio-3.39
Starting 1 thread
p9write: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1)
p9write: (groupid=0, jobs=1): err= 0: pid=100: Tue Jul 14 10:14:52 2026
  write: IOPS=839, BW=839MiB/s (880MB/s)(1024MiB/1220msec); 0 zone resets
    clat (usec): min=72, max=3869, avg=273.89, stdev=256.93
     lat (usec): min=84, max=3881, avg=294.01, stdev=262.55
    clat percentiles (usec):
     |  1.00th=[   76],  5.00th=[   78], 10.00th=[   81], 20.00th=[   86],
     | 30.00th=[   96], 40.00th=[  126], 50.00th=[  273], 60.00th=[  297],
     | 70.00th=[  322], 80.00th=[  363], 90.00th=[  506], 95.00th=[  652],
     | 99.00th=[ 1221], 99.50th=[ 1434], 99.90th=[ 2245], 99.95th=[ 3884],
     | 99.99th=[ 3884]
   bw (  KiB/s): min=851968, max=884736, per=100.00%, avg=868352.00, stdev=23170.48, samples=2
   iops        : min=  832, max=  864, avg=848.00, stdev=22.63, samples=2
  lat (usec)   : 100=31.93%, 250=14.84%, 500=43.07%, 750=5.86%, 1000=2.34%
  lat (msec)   : 2=1.76%, 4=0.20%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=10896, max=24197, avg=14288.25, stdev=2714.49
    sync percentiles (usec):
     |  1.00th=[10945],  5.00th=[11469], 10.00th=[11731], 20.00th=[11994],
     | 30.00th=[12256], 40.00th=[13042], 50.00th=[13566], 60.00th=[14353],
     | 70.00th=[15270], 80.00th=[16319], 90.00th=[17957], 95.00th=[19530],
     | 99.00th=[24249], 99.50th=[24249], 99.90th=[24249], 99.95th=[24249],
     | 99.99th=[24249]
  cpu          : usr=2.21%, sys=23.22%, ctx=195, majf=0, minf=0
  IO depths    : 1=106.2%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,63 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=839MiB/s (880MB/s), 839MiB/s-839MiB/s (880MB/s-880MB/s), io=1024MiB (1074MB), run=1220-1220msec
P9DONE write
P9ALLDONE
[    2.377312] reboot: Power down